[{"title":"Tokyo Revengers S1 (DUB)","episode":24,"description":"Watching the news, Hanagaki Takemichi learns that his girlfriend from way back in middle school, Tachibana Hinata, has died. The only girlfriend he ever had was just killed by a villainous group known as the Tokyo Manji Gang. He lives in a crappy apartment with thin walls, and his six-years-younger boss treats him like an idiot. Plus, he's a complete and total virgin... At the height of his rock-bottom life, he suddenly time-leaps twelve years back to his middle school days!! To save Hinata, and change the life he spent running away, hopeless part-timer Takemichi must aim for the top of Kanto's most sinister delinquent gang!!\n\nSource: kodansha comics","retting":5.72,"download_url":"gg","poster":"https://cdn-eu.anidb.net/images/main/258374.jpg","type":"TV Series"},{"title":"Tokyo Revengers:Christmas Showdown","episode":13,"description":"Takemichi Hanagaki is a freelancer that's reached the absolute pits of despair in his life. He finds out that the only girlfriend he ever had, in middle school, Hinata Tachibana, had been killed by the ruthless Tokyo Manji Gang. The day after hearing about her death, he's standing on the station platform and ends up being pushed over onto the tracks by a herd of people. He closes his eyes thinking he's about to die, but when he opens his eyes back up, he somehow had gone back in time 12 years. Now that he's back living the best days of his life, Takemichi decides to get revenge on his life.\n\nSource: crunchyroll","retting":5.54,"download_url":"noy","poster":"https://cdn-eu.anidb.net/images/main/283756.jpg","type":"TV Series"},{"title":"Tokyo Revengers","episode":24,"description":"Watching the news, Hanagaki Takemichi learns that his girlfriend from way back in middle school, Tachibana Hinata, has died. The only girlfriend he ever had was just killed by a villainous group known as the Tokyo Manji Gang. He lives in a crappy apartment with thin walls, and his six-years-younger boss treats him like an idiot. Plus, he's a complete and total virgin... At the height of his rock-bottom life, he suddenly time-leaps twelve years back to his middle school days!! To save Hinata, and change the life he spent running away, hopeless part-timer Takemichi must aim for the top of Kanto's most sinister delinquent gang!!\n\nSource: kodansha comics","retting":5.72,"download_url":"not","poster":"https://cdn-eu.anidb.net/images/main/258374.jpg","type":"TV Series"},{"title":"Scissor Seven","episode":10,"description":"Meow, the Chief of Cats, hires Seven to wipe out an old flame. But after hearing a star-crossed interspecies love story, he attempts to make peace. It's scissors versus sword as Seven faces off against Thirteen. He's no match for his deft opponent — so he transforms into half a durian.  Source: google","retting":7.13,"download_url":"hi","poster":"https://cdn-eu.anidb.net/images/main/222309.jpg","type":"Web"},{"title":"Dr. Stone","episode":24,"description":"One fateful day, all of humanity was petrified by a blinding flash of light. After several millennia, high schooler Taiju awakens and finds himself lost in a world of statues. However, he's not alone! His science-loving friend Senkuu's been up and running for a few months and he's got a grand plan in mind—to kickstart civilization with the power of science!\n\nSource: Viz","retting":7.51,"download_url":"hello","poster":"https://cdn-eu.anidb.net/images/main/231369.jpg","type":"TV Series"}]